# *1.1！+2！+3！+4!+5!+6! = ?
# m, n = 0, 1
# for i in range(6):
#     n = n*(i+1)
#     m = m + n
# print(m)
# 2.任意输入两个数，从较小的数，加到较大的数，求和
# 如输入：4 6
# 输出 15			（4 + 5 + 6）
# 3.输入起始值，结束值和步数（step）数数
# 如输入：1 9 2
# 输出 1 3 5 7 9
# 4.输入任意多的数，用0结尾，求这些数的和
# 5.输入一个正整数，判断这个数是不是偶数
# 6.输入一个正整数，判断这个数是不是奇数
# *7.输入一个正整数，判断这个数是不是2的幂数
# n /= 2
# *8.输入一个正整数，判断这个数是否是质数

# *9.输入一个正整数，分解质因数
# 如输入 90
# 输出 90=2X3X3X5

# 10.输入1个大于1的正整数，求如果将这个数拆成两个正整数的和，如何拆使两数的乘积最大
# 比如5 可以拆成 1 + 4 或 2 + 3
# 输出乘积

# 11.输入两个数，求两个数的阶乘和

# 12.输入十分秒，打印这个时间往后，1小时的所有秒数
# 如输入：23：12：13
# 输出：23：12：14
# 	23：12：15
# 	...
